In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame(np.array([
    [1,2,3],
    [3,4,5],
    [1,2,3],
    [6,2,4]
]), columns=['A', 'B', 'C'])
df

   A  B  C
0  1  2  3
1  3  4  5
2  1  2  3
3  6  2  4

指定列修改列名

In [3]:
df.rename(columns={'A': 'Name'})

   Name  B  C
0     1  2  3
1     3  4  5
2     1  2  3
3     6  2  4

修改全部列名

In [5]:
df.columns = ['name', 'age', 'sex']
df

   name  age  sex
0     1    2    3
1     3    4    5
2     1    2    3
3     6    2    4